<details ><summary>apply for oracle-fundaztic 2025-08-19 13:36:31 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kokkeanshern/infrastructure#oracle-fundaztic has been locked by PR #12
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # oci_identity_policy.fundaztic_ocir_policy will be created
  + resource "oci_identity_policy" "fundaztic_ocir_policy" {
      + ETag           = (known after apply)
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa4gsdatqr4iu26stu45vhvtdy3qtzzapaeztf2wazln2qhxlvfwjq"
      + defined_tags   = (known after apply)
      + description    = "Allow Fundaztic instance dynamic group to pull images from OCIR"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + lastUpdateETag = (known after apply)
      + name           = "fundaztic-ocir-policy"
      + policyHash     = (known after apply)
      + state          = (known after apply)
      + statements     = [
          + "Allow dynamic-group fundaztic-instance-dynamic-group to read repos in compartment ocid1.compartment.oc1..aaaaaaaawutq5bmyehb2obqa3hcvstm5gzmboh62p7ixwwhdvgz2r73kvynq",
        ]
      + time_created   = (known after apply)
      + version_date   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
oci_identity_policy.fundaztic_ocir_policy: Creating...
Releasing state lock. This may take a few moments...

```
</details>

</details>